<script setup>
</script>

<template>
    <div class="main">
        <h1>主线任务01:阴谋伊始</h1>
        <p>一开始的剧情后，我们会进入洛阳城郊，此时有几个支线任务可做。</p>
        <p class="tip">注意:机关人只能用“机关修复术”“铁石注生术”回复生命与体力，但是群体恢复道具以及“还魄丹”对机关人仍旧有效。</p>
        <p><a href="/pic/3swda/map/枫之舞 01 洛阳城郊.png">
                <img border="0" src="/pic/3swda/map/枫之舞 01 洛阳城郊.png"></a></p>
        <p class="nor"><b>◎支线任务:捉迷藏</b><br>
            触发地点:洛阳城郊，兰子<br>
            任务流程:与兰子对话→按图示找到所有的孩子→再次与兰子对话<br>
            任务奖励:巨蚯蚓</p>
        <p class="imp"><b>◎支线任务:陈博的实验</b><br>
            触发地点:洛阳城郊武器店，陈博<br>
            任务流程:与陈博对话→给予“鸡蛋”“人发”“人骨”“还灵丹”“巨蜈蚣”“巨蚯蚓”<br>
            任务奖励:血芝麻（绿色）<br>
            注意事项:<br>
            鸡蛋:新郑杂货铺购买<br>
            还灵丹:新郑长葛大梁许昌杂货铺购买、宝箱<br>
            人发:鬼谷妖火、新郑城郊女丑随机掉落、大梁密道布妖随机掉落、宝箱<br>
            人骨:鬼谷妖火、新郑郊外打败女丑随机掉落、宝箱<br>
            巨蚯蚓:鬼谷、炼化<br>
            巨蜈蚣:大梁原野、炼化</p>
        <p class="imp"><b>◎支线任务:蚕女的桑叶</b><br>
            触发地点:洛阳城郊民房，蚕女<br>
            任务流程:与蚕女对话→给予桑叶<br>
            任务奖励:青鱼牙（绿色）<br>
            注意事项:可多次触发，桑叶在游戏后期可得</p>
        <p>可完成的支线完成后，前往洛阳西南方的船屋，期间又有一个支线任务。</p>
        <p class="imp"><b>◎支线任务:帮助钓叟</b><br>
            触发地点:竹桥，钓叟<br>
            任务流程:与钓叟对话→给予巨蚯蚓<br>
            任务奖励:岩蚁（紫色）</p>
        <p><a href="/pic/3swda/map/枫之舞 02 船屋.png">
                <img border="0" src="/pic/3swda/map/枫之舞 02 船屋.png"></a></p>
        <p>完成支线后继续前进，到船屋触发剧情并进入大堂与公输班对话后，搜集物品进入机关密道。</p>
        <p class="tip">提示:木人兵攻击力较强，注意回复，若有压力可在原野练级至辅子彻学会初阳温火符，练出符咒后机关人可用，对木人兵伤害巨大。</p>
        <p class="nor"><b>◎支线任务:修复机关人</b><br>
            触发地点:船屋机关密道，坏的机关人<br>
            任务流程:调查坏的机关人→选择“是”<br>
            任务奖励:与机关人开战</p>
        <p>在行进途中遇到公输班的弟子痴木，他告诉辅子彻有一个木人兵的心（巨鼠）跑了出来，导致机关人堵在路上，希望我们找到它后交还。找到巨鼠旺福后，我们有两个选择:<br>
            1.将巨鼠旺福交还痴木，再与木人兵战斗。<br>
            2.给机关人装备巨鼠旺福再向痴木复命，可增强机关人属性并避免一场战斗。<br>
            到达尽头后触发剧情，机关人与鲁班将军号开战。</p>
        <h2>◎BOSS:鲁班将军号</h2>
        <p><a href="/pic/3swda/boss/image003.png">
                <img border="0" src="/pic/3swda/boss/image003.png"></a></p>
        <p class="tip">说明:本战难度较大，建议预先炼一张初阳温火符给机关人使用。开战前机关人会完全恢复，并且此战失败可以继续剧情。</p>
        <p>战后辅子彻说明来意，公输班让辅子彻前往东南方的少室山找鬼谷子。</p>
    </div>
    <div class="main">
        <h1>主线任务02:初遇佳人</h1>
        <p>进入少室山后，触发剧情，往西边走调查棺材，触发剧情，桑纹锦入队。继续上山，途中注意收集物品。（桑纹锦很脆弱，可先在大地图练级）</p>
        <p><a href="/pic/3swda/map/枫之舞 03 太室山、鬼谷.png">
                <img border="0" src="/pic/3swda/map/枫之舞 03 太室山、鬼谷.png"></a></p>
        <p>到达雪屋后，进入大堂右方房间，触发剧情，回大堂与鬼谷子对话，询问相关事宜后进入木人巷挑战草枢。调查陶人会进入战斗，战斗胜利后机关墙会移动至你调查的地方，复位开关可以使全部机关墙复位，但调查之前战胜的陶人无需再次战斗即可移动机关墙。调查草枢后进入BOSS战。
        </p>
        <p class="tip">与大甲子对话可免费回复，无需节省灵力体力。</p>
        <h2>◎BOSS:草枢机关阵</h2>
        <p><a href="/pic/3swda/boss/image005.png">
                <img border="0" src="/pic/3swda/boss/image005.png"></a></p>
        <p><a href="/pic/3swda/boss/image006.png">
                <img border="0" src="/pic/3swda/boss/image006.png"></a></p>
        <p class="tip">说明:本战难度较大，建议练级至桑纹锦学会气还咒后再来挑战。当草枢机关阵闭合后只承受普通攻击伤害（法术，武技全部无效），并且下一回合必定使用武技“残影击”（群体攻击），注意回复。</p>
        <p>战胜后机关人学会“残影击”，回鬼谷子处复命，孙宾加入队伍（不参战），前往洛阳城郊右方的碉堡。</p>
        <p class="nor"><b>◎支线任务:贾鲁河的鬼魅其一</b><br>
            触发地点:贾鲁河桥上<br>
            任务流程:通过贾鲁河桥<br>
            注意事项:只有孙宾在队伍时才可触发</p>
        <p class="nor"><b>◎支线任务:贾鲁河的鬼魅其二</b><br>
            触发地点:贾鲁河上游<br>
            任务流程:前往贾鲁河桥南方的贾鲁河源头→来到图示位置自动触发战斗<br>
            任务奖励:捏面人<br>
            注意事项:只有孙宾在队伍时才可触发</p>
        <p><a href="/pic/3swda/body/image007.png">
                <img border="0" src="/pic/3swda/body/image007.png"></a></p>
    </div>
    <div class="main">
        <h1>主线任务03:机关军团</h1>
        <p>在碉堡里，孙宾出示周天子的令牌，一行人得以来到韩国。通过关卡后往东南方进入新郑，这里有一些支线任务。</p>
        <p><a href="/pic/3swda/map/枫之舞 04 新郑城郊、韩国兵营.png">
                <img border="0" src="/pic/3swda/map/枫之舞 04 新郑城郊、韩国兵营.png"></a></p>
        <p class="nor"><b>◎支线任务:猜谜</b><br>
            触发地点:新郑城郊，舞枪艺人北方小孩<br>
            任务流程:与小孩对话→选择“是”并交出300钱→根据提示找到六样物品后与小孩对话<br>
            任务奖励:陶器，松月漆，还灵丹，金属，刀币，青铜钟，300钱</p>
        <p class="nor"><b>◎支线任务:鸡舍情缘</b><br>
            触发地点:新郑城郊，鸡舍<br>
            任务流程:调查鸡舍<br>
            任务奖励:蜃珠，鸡蛋<br>
            注意事项:只有孙宾在队伍时才可触发，之后再次调查鸡舍可花20两购买鸡蛋，次数不限</p>
        <p class="nor"><b>◎支线任务:修理木伞</b><br>
            触发地点:新郑城郊上方民房，紫衣姑娘<br>
            任务流程:与紫衣姑娘对话→到下方民房与罗大婶对话→到新郑城郊右方与小孩对话并花10两购买蚕丝→向紫衣姑娘复命<br>
            任务奖励:昆吾剑</p>
        <p class="nor"><b>◎支线任务:寻找药材</b><br>
            触发地点:新郑城郊药店，大夫<br>
            任务流程:与大夫对话→给予“百年人参”和“神秘果”<br>
            任务奖励:还魄丹</p>
        <p class="nor"><b>◎支线任务:剑之殇</b><br>
            触发地点:新郑城郊打铁铺，混混<br>
            任务流程:与混混对话→与铁匠对话→离开打铁铺触发战斗<br>
            注意事项:该支线自桑纹锦长葛镇离队后关闭</p>
        <p class="imp"><b>◎支线任务:墨家的支援其一</b><br>
            触发地点:新郑城郊客栈二楼，陈成<br>
            任务流程:与陈成对话<br>
            任务奖励:开启新郑地区寄存功能</p>
        <p>到新郑城郊下方军营，触发剧情，前往军营东方的殷商废墟。</p>
        <p><a href="/pic/3swda/map/枫之舞 05 殷商废墟全图.png">
                <img border="0" src="/pic/3swda/map/枫之舞 05 殷商废墟全图.png"></a></p>
        <p class="nor"><b>◎支线任务:亡魂的执念其一</b><br>
            触发地点:殷商废墟地道一层，骷髅<br>
            任务流程:与骷髅对话→给予“陀螺”<br>
            任务奖励:傀儡<br>
            注意事项:只有桑纹锦在队伍时才可触发</p>
        <p class="nor"><b>◎支线任务:亡魂的执念其二</b><br>
            触发地点:殷商废墟地道一层，骷髅<br>
            任务流程:与骷髅对话→给予“干粮”<br>
            注意事项:只有桑纹锦在队伍时才可触发<br>
            任务奖励:清散咒土</p>
        <p class="nor"><b>◎支线任务:亡魂的执念其三</b><br>
            触发地点:殷商废墟地道一层，骷髅<br>
            任务流程:与骷髅对话→给予“土地神符”<br>
            任务奖励:铁胡剑</p>
        <p class="nor"><b>◎支线任务:墙壁上的鬼脸</b><br>
            触发地点:殷商废墟地道一层<br>
            任务流程:调查墙壁<br>
            任务奖励:反八卦印<br>
            注意事项:只有孙宾在队伍时才可触发</p>
        <p>只有取得避火珠后才能进入殷商废墟地道，在第三层与挡住去路的机关人将军对话，在前方的香炉处存档。进入第四层，触发剧情，孙宾离队，全员完全恢复，进入BOSS战。</p>
        <h2>◎BOSS:疾鹏</h2>
        <p><a href="/pic/3swda/boss/image010.png">
                <img border="0" src="/pic/3swda/boss/image010.png"></a></p>
        <p class="tip">说明:本战难度一般，疾鹏电爪和疾电符威力较大，注意回复。疾鹏会透骨正气符，建议不要节省灵力法术攻击速战速决。</p>
        <p>战后继续剧情，疾鹏入队（不参战），辅子彻学会“疾鹏电爪”。回军营韩虔将军处复命，触发剧情，一行人来到树林内，寻找绑架贵族的逃兵集团。</p>
    </div>
</template>