<script>

</script>

<template>
    <div class="main">
        <h1>主线任务01:大破野熊寨</h1>
        <p>一开始的剧情动画之后，主角一行人到达原野。</p>
        <p><a href="/pic/2swd2/map/01.安定村.bmp">
                <img border="0" src="/pic/2swd2/map/01.安定村.bmp"></a></p>
        <p>进入旁边的安定村，先与客栈老板对话，再到门口被小孩挡住的房子前与小孩对话后，小孩会让开，之后进入房子内与村长对话。之后会休息一晚，全员完全恢复。第二天众人决定捣毁野熊寨，救出小三子的父亲。野熊寨在安定村的南方。</p>
        <p><a href="/pic/2swd2/map/02.野熊寨.bmp">
                <img border="0" src="/pic/2swd2/map/02.野熊寨.bmp"></a></p>
        <p class="tip">与野熊寨的大部分npc都会触发战斗，敌人均为一名强盗，建议全部对话稍微练练级，之后触发剧情这些npc会全部消失。</p>
        <p>一直深入野熊寨，在山洞深处与座椅上的火眼狻猊对话后，触发BOSS战。</p>
        <h2>◎BOSS:火眼狻猊</h2>
        <p><a href="/pic/2swd2/boss/攻略·起之章262.png">
                <img border="0" src="/pic/2swd2/boss/攻略·起之章262.png"></a></p>
        <p>战胜后原路返回，与洞口的书生对话，再返回安定村与小三子的爹对话，返回野熊寨山洞深处。调查座椅右边墙壁的雕印，打开密道入口，离开野熊寨。 </p>
    </div>
    <div class="main">
        <h1>主线任务02:初遇壶中仙</h1>
        <p>出了密道以后，东南方河边便能看到临河镇。</p>
        <p><a href="/pic/2swd2/map/03.临河镇.bmp">
                <img border="0" src="/pic/2swd2/map/03.临河镇.bmp"></a></p>
        <p class="nor"><b>◎支线任务: 不沾赌</b><br>
            触发地点:赌场，施民<br>
            任务流程:与施民对话→选择“否”触发战斗（强盗）→与赌场内克敏对话→与赌场旁民房内老爷爷、小孩、妇人对话<br>
            任务奖励:完全恢复一次（老爷爷）、铃鼓（小孩）、解病万灵丹（妇人）</p>
        <p class="nor"><b>◎支线任务: 不沾色</b><br>
            触发地点:烟月作坊，兰儿<br>
            任务流程:与兰儿对话→触发战斗（女丑姬）→与兰儿对话<br>
            任务奖励:还魄丹<br>
            注意事项:需完成支线“不沾赌”方可触发</p>
        <p>与临河镇镇长对话，镇长答应借给众人船只。前往镇内西北方的渡口，调查小船即可触发剧情，众人下河遭遇妖魔，掉入陵羊大泽。</p>
        <p><a href="/pic/2swd2/map/04.湖底洞、水神庙、北山洞穴.bmp">
                <img border="0" src="/pic/2swd2/map/04.湖底洞、水神庙、北山洞穴.bmp"></a></p>
        <p>往东南方向走，进入山神庙后与石狮对话，此时可以到庙外存档，进入陵羊大泽内原路返回发现蛟龟，与其对话进入BOSS战。</p>
        <h2>◎BOSS:旋龟</h2>
        <p><a href="/pic/2swd2/boss/攻略·起之章700.png">
                <img border="0" src="/pic/2swd2/boss/攻略·起之章700.png"></a></p>
        <p class="tip">说明:此战难度较大，蛟龟残血时会无限回血，建议速战速决，如果战斗吃力可以多练级再挑战。</p>
        <p>战后蛟龟仓促逃跑，南边的通道打开，此时可以从陵羊大泽北边打开通道返回临河镇与镇长对话，获得一百钱。</p>
    </div>
    <div class="main">
        <h1>主线任务03:沁水镇除妖</h1>
        <p>从旋龟打开的通道进入，到达北山洞穴。一直往南边走，进入大地图，往北方走进入沁水镇。 </p>
        <p><a href="/pic/2swd2/map/05.沁水镇.bmp">
                <img border="0" src="/pic/2swd2/map/05.沁水镇.bmp"></a></p>
        <p class="nor"><b>◎支线任务: 囊中羞涩</b><br>
            触发地点:沁水镇民宅，二郎<br>
            任务流程:与二郎对话→选择“可”并给予10钱→离开民宅后再次进入与二郎对话<br>
            任务奖励:20钱 </p>
        <p class="nor"><b>◎支线任务: 妖魔惑心</b><br>
            触发地点:沁水镇民宅，长工<br>
            任务流程:与长工对话→与婢女对话触发战斗（夫人）→与夫人对话<br>
            任务奖励:50两 </p>
        <p>到镇长家与镇长对话选择“可”了解匏鹗的信息，之后前往沁水镇北方的矿坑。</p>
        <p><a href="/pic/2swd2/map/06.矿坑.bmp">
                <img border="0" src="/pic/2swd2/map/06.矿坑.bmp"></a></p>
        <p>到达矿坑深处后，触发BOSS战。</p>
        <h2>◎BOSS:匏鸮</h2>
        <p><a href="/pic/2swd2/boss/攻略·起之章1069.png">
                <img border="0" src="/pic/2swd2/boss/攻略·起之章1069.png"></a></p>
        <p>战胜匏鸮后，调查下方的石碑，得知打开大禹水道的方法，一行人准备前往北山洞穴。</p>
    </div>
    <div class="main">
        <h1>主线任务04:通天之传说</h1>
        <p>进入北山洞穴一直往北走，到终点后调查墙壁上的符文，大禹水道通道打开，离开洞穴前往西方的大禹水道。</p>
        <p><a href="/pic/2swd2/map/07.大禹地下水道（一）.bmp">
                <img border="0" src="/pic/2swd2/map/07.大禹地下水道（一）.bmp"></a></p>
        <p>调查最深处的宝箱，古月圣入队并触发剧情战（石狮精X2）。战后离开大禹水道，前往西北方的道观，与道士对话后进入道观北方的大树——建木。</p>
        <p><a href="/pic/2swd2/map/09.道观、建木.bmp">
                <img border="0" src="/pic/2swd2/map/09.道观、建木.bmp"></a></p>
        <p>进入建木后先进入前方房屋与老人对话，触发剧情战（左门神、右门神），之后从房屋西边的楼梯进入建木底层。到达终点后，触发BOSS战。</p>
        <h2>◎BOSS:建木妖道</h2>
        <p><a href="/pic/2swd2/boss/攻略·起之章1332.png">
                <img border="0" src="/pic/2swd2/boss/攻略·起之章1332.png"></a></p>
        <p class="tip">说明:建木妖道会封魔技能，难度不大。 </p>
        <p>战胜建木妖道后，从另一个楼梯离开，来到平阳城周边的原野。</p>
    </div>
</template>