<script setup>const img000 = '/pic/3swda/map/枫之舞 11 大梁城郊.png'const img001 = '/pic/3swda/map/枫之舞 12 大梁密道、大梁皇宫.png'const img002 = '/pic/3swda/boss/image023.png'const img003 = '/pic/3swda/boss/image024.png'const img004 = '/pic/3swda/map/枫之舞 13 洞穴、祭坛.png'const img005 = '/pic/3swda/boss/image026.png'const img006 = '/pic/3swda/map/枫之舞 14 树海.png'const img007 = '/pic/3swda/boss/image028.png'const img008 = '/pic/3swda/map/枫之舞 15 许昌.png'const img009 = '/pic/3swda/map/枫之舞 16 安策军队、鄢陵.png'const img010 = '/pic/3swda/boss/image031.png'const img011 = '/pic/3swda/boss/image032.png'const img012 = '/pic/3swda/map/枫之舞 17 战车.png'const img013 = '/pic/3swda/boss/image034.png'
</script>

<template>
    <div class="main">
        <h1>主线任务07:魏国祸乱</h1>
        <p><a href="img000">
                <img border="0" src="img000"></a></p>
        <p>到达客栈后，与入座的铸石子对话，触发剧情，前往大梁密道救出桑纹锦，铸石子入队。</p>
        <p class="tip">小纸条:站在上帝视角来看，桑先生的身份真是一目了然。不过剧情中辅子彻与铸石子二人只在长葛镇远远见过他一面，没一下子认出来也是自然的。</p>
        <p class="nor"><b>◎支线任务:井中之宝</b><br>
            触发地点:大梁药铺外，瑛儿<br>
            任务流程:与瑛儿对话→选择“是”→进入药铺并与厨房内的瑛儿对话<br>
            任务奖励:铜镜，千年参心丹</p>
        <p class="nor"><b>◎支线任务:铸剑名师</b><br>
            触发地点:大梁打铁铺，铸剑师<br>
            任务流程:与铸剑师对话→给予“飞长蛇”“人骨”“昆吾剑”“青铜钟”“人骨”与200钱<br>
            任务奖励:镇狱<br>
            注意事项:可无限次触发</p>
        <p class="nor"><b>◎支线任务:友人的宝藏</b><br>
            触发地点:大梁民房，陶老爷<br>
            任务流程:与陶老爷对话得知提示→调查城门左侧石狮→调查杂货铺旁推车→调查东北方水井→调查城门左侧墙壁<br>
            任务奖励:银块，百年人参，盘古眼，玉石，鸡血石，250钱</p>
        <p class="nor"><b>◎支线任务:打墙壁</b><br>
            触发地点:大梁特殊场所，主持人<br>
            任务流程:与主持人对话→选择“否”→在规定回合数内打破墙壁<br>
            任务奖励:嘉果，解病万灵丹，青铜发饰（均在暗室宝箱内）</p>
        <p><a href="img001">
                <img border="0" src="img001"></a></p>
        <p>来到大梁皇宫后花园后，触发剧情，陈祥入队（不参战）。即将进入书房时，触发BOSS战。</p>
        <h2>◎BOSS:宫廷刺客</h2>
        <p><a href="img002">
                <img border="0" src="img002"></a></p>
        <p class="tip">说明:宫廷刺客会分身，三个目标里只有一个是有效攻击对象，武技与法术对宫廷刺客无效。</p>
        <p>战胜后从书房进入皇宫前，与皇宫正门口士兵对话后，前往右偏门石室，西门豹入队（不参战），通过暗道后桑纹锦入队，触发BOSS战。</p>
        <h2>◎BOSS:李勤</h2>
        <p><a href="img003">
                <img border="0" src="img003"></a></p>
        <p class="tip">说明:李勤攻击力较高，注意回复，建议给桑纹锦使用踏风符增加防御，闪避与敏捷。</p>
        <p>战后从大梁密道离开，途中触发剧情战（玄火铜兵），西门豹，陈祥离队，疾鹏入队。回墨者居所辅子彻房间，与田衍对话触发剧情，机关人入队且全员完全恢复。到东南方客房与禽滑厘对话，得知许昌在长葛南方，此时可在田衍处寄放物品。（仅此一次，之后在到达许昌前没有任何寄存机会）
        </p>
        <p class="imp"><b>◎支线任务:冥蛇</b><br>
            触发地点:大梁，景政<br>
            任务流程:与景政对话→进入景政旁边的房间→走至迷宫终点的八卦阵→击败冥蛇<br>
            任务奖励:无</p>
        <p><a href="img004">
                <img border="0" src="img004"></a></p>
        <h2>◎BOSS:冥蛇</h2>
        <p><a href="img005">
                <img border="0" src="img005"></a></p>
        <p class="tip">说明:此战难度一般，冥蛇攻击带中毒属性，会风砂甘霖符，速战速决。</p>
    </div>
    <div class="main">
        <h1>主线任务08:树海蝶谷</h1>
        <p>通过长葛镇南方的关卡（须缴纳300钱过路税），辅子彻一行人来到树海。</p>
        <p><a href="img006">
                <img border="0" src="img006"></a></p>
        <p>走至终点，遇到一个山贼，要辅子彻缴纳过路税3000钱，如果不给则触发BOSS战。</p>
        <h2>◎BOSS:盗贼王</h2>
        <p><a href="img007">
                <img border="0" src="img007"></a></p>
        <p class="tip">说明:此战难度较大，盗贼王免疫法术与武技，防御力也极高，谨慎挑战。桑纹锦的邪心蛊符对盗贼王有效，建议使用邪心蛊符后全员防御等待盗贼王自损血至死。</p>
        <p>来到韩国南部大地图，一直往南方走到终点后往西走即可进入许昌。</p>
        <p><a href="img008">
                <img border="0" src="img008"></a></p>
        <p class="imp"><b>◎支线任务:阿鲍的收藏其二</b><br>
            触发地点:许昌武器铺，阿鲍<br>
            任务流程:与阿鲍对话→给予“妖火”“长蛇”“石狮精”“火光兽”“天吴”“巨蜈蚣”<br>
            任务奖励:金蚕</p>
        <p class="nor"><b>◎支线任务:丈夫的心愿</b><br>
            触发地点:许昌客栈边民房，病人<br>
            任务流程:与病人对话→给予“陀螺”“铃鼓”“铜镜”<br>
            任务奖励:泰山独脚鞋</p>
        <p class="imp"><b>◎支线任务:传话</b><br>
            触发地点:许昌民房，李大娘<br>
            任务流程:与李大娘对话→到大梁工艺之家青年及杂工对话→与李大娘对话<br>
            任务奖励:无限次免费回复</p>
        <p class="imp"><b>◎支线任务:墨家的支援其三</b><br>
            触发地点:许昌客栈，田衍<br>
            任务流程:与田衍对话<br>
            任务奖励:开启许昌地区寄存功能</p>
        <p>进入许昌后，到客栈二楼与墨子对话，触发剧情，疾鹏，桑纹锦，铸石子离队，墨子，禽滑厘入队（不参战）。</p>
    </div>
    <div class="main">
        <h1>主线任务09:鄢陵之战</h1>
        <p>一行人到北方安策宫殿享天与安策交涉，自动来到鄢陵附近，墨子，禽滑厘离队，疾鹏，桑纹锦，铸石子入队，辅子彻决定先前往鄢陵调查一番。（此时可与田衍对话寄存）</p>
        <p><a href="img009">
                <img border="0" src="img009"></a></p>
        <p>先到达城门触发剧情，再与客栈旁无赖对话，回禽滑厘处复命，触发剧情，接下来有连续的BOSS战。</p>
        <p class="tip">小纸条:与抱婴妇女，杂货铺内农民，店小二对话会进入战斗，在鄢陵调查一些地方会失去金钱。</p>
        <h2>◎BOSS:战车守将＆战车机关</h2>
        <p><a href="img010">
                <img border="0" src="img010"></a></p>
        <p><a href="img011">
                <img border="0" src="img011"></a></p>
        <p>战后辅子彻一行人进入战车内打算找到控制机关。</p>
        <p class="tip">调查楼梯旁的地脉神水可完全恢复并存档。</p>
        <p><a href="img012">
                <img border="0" src="img012"></a></p>
        <p>到达机关中枢时，自动触发BOSS战。</p>
        <h2>◎BOSS:傀儡剑客+傀儡仙女</h2>
        <p><a href="img013">
                <img border="0" src="img013"></a></p>
        <p class="tip">小纸条:据说枫之舞原本设定天神都是机关的，不过后续作品由于编剧更替该设定废弃了。</p>
        <p>战后触发剧情，辅子彻操控战车停止，接着往前走进入天政。</p>
    </div>
</template>