<script setup>
</script>

<template>
    <div class="main">
        <h1>无用支线</h1>
        <p class="tip">说明:本栏展示的是枫之舞中可以触发支线剧情但没有任何实际奖励的支线,括号内为触发对象。</p>
        <h2>洛阳城郊</h2>
        <p><b>乞丐乞讨（客栈门口的乞丐）</b><br>
            给予10钱，乞丐会叫辅子彻“公子”。</p>

        <p><b>桃花缘（客栈内的美女）</b><br>
            与客栈内的美女对话，日后在各处客栈都会遇到她。</p>

        <p><b>钱能通神（王城门口士兵）</b><br>
            为进入王城给予20钱，然而付了钱也没能进入王城。</p>

        <p><b>黄河水患（洛阳北的黄河）</b><br>
            靠近黄河，辅子彻会发表一番感慨。</p>

        <p><b>泥水无情（泥水）</b><br>
            经过泥水处，桑纹锦会惊呼辅子彻的衣服被泥水弄脏。</p>

        <h2>新郑城郊</h2>
        <p><b>报平安（军营士兵宵宵）</b><br>
            士兵宵宵希望辅子彻和药铺内的母亲报平安，辅子彻转告后，她母亲很高兴。</p>

        <p><b>与猫对话其一（药铺的猫）</b><br>
            辅子彻与猫交谈，桑纹锦惊呆了。</p>

        <h2>大梁</h2>
        <p><b>药学重地（药铺掌柜）</b><br>
            辅子彻想要进入药铺柜台，掌柜拒绝了他。</p>

        <h2>长葛镇</h2>
        <p><b>救济老翁（茅屋前老翁）</b><br>
            辅子彻给予100钱给儿子拉去建地下城后再无音讯的老翁，并调侃了疾鹏一番。</p>

        <h2>许昌</h2>
        <p><b>空气税（西方士兵）</b><br>
            士兵要求辅子彻一行人缴纳“空气芬芳税”，辅子彻表示自己是安策的救命恩人。</p>

        <p><b>一言不合（东方士兵）</b><br>
            士兵与辅子彻一言不合即将开战，关键时刻士兵却逃跑了。</p>

        <p><b>与猫对话其二（药铺的猫）</b><br>
            辅子彻与猫交谈，并调侃了疾鹏一番。</p>
    </div>
</template>