<script setup>
</script>

<template>
    <div class="main">
        <h1>战斗分支</h1>
        <p class="tip">说明:本栏展示的是枫之舞中可以触发分支选项的战斗对话，没有任何分支的战斗对话（诸如猎户打劫）不做赘述。</p>
        <h2>洛阳城郊原野</h2>
        <p class="nor"><b>为富不仁（富商+保镖X2）</b><br>
            内容:富商要求辅子彻花300钱买一个松月漆<br>
            <span style="color: red;">A.当选择“是”且金钱≥300时，得到松月漆，失去300钱<br>
                B.当选择“是”且金钱＜300或选择“否”时，开战</span><br>
            触发B情况时，若打败保镖X2且富商未被打败，触发富商求饶事件，选择“是”必定得到富商的金钱与松月漆，选择“否”可能得到松月漆
        </p>

        <p class="nor"><b>巫医借钱（巫医）</b><br>
            内容:巫医要求辅子彻给予100钱<br>
            <span style="color: red;">A.当选择“是”且金钱≥100时，失去100钱<br>
                B.当选择“是”且金钱＜100或选择“否”时，开战</span>
        </p>

        <p class="nor"><b>蟾蜍治病（巫医+蟾蜍）</b><br>
            内容:巫医说自己的蟾蜍发觉辅子彻一行人生病了，要武力带众人回去治疗<br>
            若先打败蟾蜍且巫医未被打败，下一回合触发巫医狂暴事件</p>

        <p class="nor"><b>公子报仇（贵族公子+猎户）</b><br>
            内容:若在武器店与贵族公子对话，他会在原野与猎户一道宣战</p>

        <h2>新郑城郊原野</h2>
        <p class="nor"><b>猫和老鼠（猫+鼠）（桑纹锦在队）</b><br>
            内容:桑纹锦看到有只猫在追一只老鼠，动了恻隐之心，要辅子彻去救老鼠<br>
            若鼠第一回合存活，则必定逃跑，猫不能被吞噬与收化</p>

        <p class="nor"><b>天下第一（剑客）</b><br>
            内容:自称天下第一的剑客要与辅子彻单挑</p>

        <p class="nor"><b>打劫（强盗+商人）</b><br>
            内容:遭遇强盗的商人向路过的众人求救<br>
            若击败强盗，则获赠200钱</p>

        <h2>逃兵洞穴</h2>
        <p class="nor"><b>酒香醉人（酒精）</b><br>
            内容:酒精请众人喝酒<br>
            <span style="color: red;">A.若选“是”，触发喝酒事件<br>
                B.若选“否”，开战</span><br>
            触发A情况时，50%几率全员中毒，50%几率全员回复
        </p>

        <h2>长葛镇原野</h2>
        <p class="nor"><b>解救奴隶（保镖+奴隶）（铸石子在队）</b><br>
            内容:即将被押回贵族处的奴隶向众人求救，铸石子对贵族藐视人性的行为非常愤怒<br>
            若击败保镖，则获得奴隶的感谢</p>

        <p class="nor"><b>以物易物（龟龙）（桑纹锦在队）</b><br>
            内容:龟龙询问众人是否有绞心丸来换取物品<br>
            <span style="color: red;">A.若有绞心丸且选择“是”，得到解病万灵丹，失去绞心丸<br>
                B.若无绞心丸且选择“是”或选择“否”，触发龟龙骂人事件</span><br>
            触发B情况时，龟龙询问众人是否开战，选择“是”开战，可能得到解病万灵丹，选择“否”离开
        </p>

        <h2>长葛地下城</h2>
        <p class="nor"><b>缚灵妖机（灶神+招灵机关）</b><br>
            内容:被招灵机关困住的灶神向众人求救<br>
            若击败招灵机关，可让灶神入队</p>

        <p class="nor"><b>灶神的帮助（灶神）</b><br>
            内容:灶神给予众人还灵丹，希望众人解救地下城的百姓</p>


        <h2>大梁原野</h2>
        <p class="nor"><b>教训贵族其一（保镖+贵族+阴阳师）（铸石子在队）</b><br>
            内容:贵族准备抓辅子彻一行人做奴隶，铸石子对贵族藐视人性的行为非常愤怒<br>
            若先击败保镖和阴阳师，触发贵族求饶事件，选项对结果无影响</p>

        <p class="nor"><b>教训贵族其二（保镖+贵族+阴阳师）（铸石子在队）</b><br>
            内容:贵族对之前的事情怀恨在心，召集手下前来寻仇<br>
            若先击败保镖和阴阳师，触发贵族求饶事件，选项对结果无影响</p>

        <p class="nor"><b>行侠仗义其一（随机妖魔战斗）</b><br>
            内容:遇到妖魔后第二回合红袍侠士会出手相助</p>

        <p class="nor"><b>行侠仗义其二（红袍侠士）</b><br>
            内容:重逢的红袍侠士希望与辅子彻一行人比试<br>
            <span style="color: red;">A.若选“是”并击败红袍侠士，则需继续击败“天兵”<br>
                B.若选否，结束战斗</span>
        </p>


        <p class="nor"><b>红颜祸水（觋+龙人）</b><br>
            内容:觋看辅子彻一行人不顺眼，教唆龙人攻击他们<br>
            若先击败龙人且觋未被打败，下一回合触发觋狂暴事件</p>

        <p class="nor"><b>功亏一篑（觋）</b><br>
            内容:觋正在施法，向众人讨要施法所需的嘉果<br>
            <span style="color: red;">A.若有嘉果且选“是”，觋会召唤风火龟开战<br>
                B.若无嘉果且选“是”或选“否”，直接开战</span>
        </p>

        <p class="nor"><b>无意冒犯其一（化民+化民女）</b><br>
            内容:第二回合若未结束战斗，金童玉女会出来解释辅子彻一行人侵占了化民的居住地，希望他们离开<br>
            <span style="color: red;">A.若选“是”，结束战斗<br>
                B.若选“否”，与金童玉女开战</span>
        </p>

        <h2>树海</h2>
        <p class="nor"><b>无意冒犯其二（蝶仙）</b><br>
            内容:蝶仙怒斥人类捕捉她的同族，询问众人是否也是来捕捉她的<br>
            <span style="color: red;">A.若选“是”，蝶仙召唤妖龙，开战<br>
                B.若选“否”，结束战斗</span>
        </p>

        <p class="nor"><b>缘分（蝶仙）</b><br>
            内容:蝶仙想要辅子彻给予一张“疾电符”<br>
            <span style="color: red;">A.若有“疾电符”且选“是”，得到蝶仙<br>
                B.若无“疾电符”且选“是”或选“否”，结束战斗</span>
        </p>

        <p class="nor"><b>强者为王（延维）</b><br>
            内容:延维召唤化民意图驱赶众人，战胜后延维表示希望能加入队伍</p>

        <p class="nor"><b>紧急救援其一（苍蟒+猎户）</b><br>
            内容:苍蟒正在袭击猎户，两回合内打败苍蟒可得到百年人参</p>

        <h2>许昌原野</h2>
        <p class="nor"><b>为商不仁（野奴）</b><br>
            内容:野奴要求辅子彻花200钱买一罐酒<br>
            <span style="color: red;">A.若选“是”，得到酒，失去200钱<br>
                B.若选“否”，开战</span>
        </p>

        <p class="nor"><b>无妄之灾其一（侠客+大小姐）（桑纹锦在队）</b><br>
            内容:侠客追大小姐无果，因桑纹锦嬉笑决定打败众人证明自己实力</p>

        <p class="nor"><b>无妄之灾其二（侠客）</b><br>
            内容:侠客对之前的事情怀恨在心，向众人寻仇</p>

        <p class="nor"><b>嗜血流民（流民）（桑纹锦在队）</b><br>
            内容:碰到了想喝人血的流民，击败后变为冤魂，桑纹锦推测这也是蜀桑子造出的失败品</p>

        <p class="nor"><b>劫匪遭劫（飞贼）（铸石子在队）</b><br>
            内容:遇到拦路打劫的飞贼，铸石子感慨自己劫人无数，今日却被人打劫</p>

        <p class="nor"><b>安策的指令（阴阳师）（机关人在队）</b><br>
            内容:遇到奉安策之命销毁机关的阴阳师，因其意图销毁辅子彻的机关人，众人与其开战</p>

        <h2>天政</h2>
        <p class="nor"><b>猜谜（烛阴）</b><br>
            内容:烛阴要求辅子彻猜测自己是否打算吃掉他们<br>
            <span style="color: red;">A.若选“是”，得到嘉果，开战<br>
                B.若选“否”，开战</span>
        </p>

        <p class="nor"><b>炼仙化神（门神X2）</b><br>
            内容:第一次遇到拦路的门神时，门神会告知众人他们是蜀桑子制造出来的</p>

        <h2>许昌原野（异变后）</h2>
        <p class="nor"><b>紧急救援其二（化民+旅人）</b><br>
            内容:化民正在袭击旅人，一回合内打败化民可得到旅人的感谢</p>

        <p class="nor"><b>紧急救援其三（化民+商人）</b><br>
            内容:化民正在袭击商人，一回合内打败化民可得到商人的感谢</p>

        <p class="nor"><b>紧急救援其四（机关魔人+化民+贵族）</b><br>
            内容:化民与机关魔人正在袭击贵族，一回合内打败化民与机关魔人可得到20钱</p>

        <h2>天外天</h2>
        <p class="nor"><b>仙人的劝告其一（仙女）</b><br>
            内容:仙女劝众人离开<br>
            <span style="color: red;">A.若选“是”，结束战斗<br>
                B.若选“否”，仙女召唤迷魂雾妖X2，开战</span>
        </p>

        <p class="nor"><b>仙人的劝告其二（土地神）</b><br>
            内容:土地神给予众人土地神符，劝众人离开</p>

        <p class="nor"><b>仙人的劝告其三（土地神）</b><br>
            内容:再次遇到土地神，开战</p>

        <p class="nor"><b>神仙的友谊其一（商人+旅人）</b><br>
            内容:遇到商人与旅人，变身为风神与雷神并扬言要打败众人，但前两个回合他们在为谁先出手而互相谦让，在第三回合才决定一起出击<br>
            <span style="color: red;">A.若先杀死风神，雷神会狂暴<br>
                B.若先杀死雷神，风神会狂暴</span>
        </p>

        <p class="nor"><b>神仙的友谊其二（风神+雷神）</b><br>
            内容:风神与雷神决定玩先把谁打死的游戏，辅子彻则打算与铸石子玩谁先被他们打死的游戏，疾鹏也想要参加<br>
            <span style="color: red;">A.若先杀死风神，雷神会狂暴<br>
                B.若先杀死雷神，风神会狂暴</span>
        </p>

        <p class="nor"><b>红颜祸水（狐狸精+冥府判官）</b><br>
            内容:若之前打败过未变身的狐狸精，狐狸精会叫来冥府判官寻仇</p>

        <h2>墓穴</h2>
        <p class="nor"><b>大惊小怪（妖灯鬼）</b><br>
            内容:妖灯鬼叫来蝎精打算将众人吃掉</p>

        <h2>机关龙</h2>
        <p class="nor"><b>鬼斧神工其一（化民法师+机关炮）</b><br>
            内容:化民法师打算用众人试验机关炮的威力，结果被机关炮轰炸逃跑</p>

        <p class="nor"><b>鬼斧神工其二（化民法师+火龙精）</b><br>
            内容:化民法师打算用众人试验火龙精的威力，结果被火龙精的法术击中</p>


        <p class="nor"><b>瘟神的礼物（瘟神）</b><br>
            内容:瘟神想要送你一件宝物，询问你是否接受<br>
            <span style="color: red;">A.若选“是”，则得到泥堆，结束战斗<br>
                B.若选“否”，开战，一定几率得到泥堆</span>
        </p>

        <p class="nor"><b>机关卵的妙用（魍魉）</b><br>
            内容:魍魉向你索要五个机关卵<br>
            <span style="color: red;">A.若选“是”且有五个机关卵，则得到机关天将，开战<br>
            B.若选“是”且无五个机关卵或选“否”，结束战斗</span>
    </p>

    <p class="nor"><b>暴虐的尸解仙（女尸+尸解仙）</b><br>
        内容:尸解仙强迫女尸打败众人<br>
        <span style="color: red;">A.若先杀死尸解仙，女尸会请求加入队伍<br>
            B.若先杀死女尸，尸解仙会逃跑</span>
    </p>

    <p class="nor"><b>暴虐的铁将军（火刃将军）</b><br>
        内容:若一回合内未打败火刃将军，铁将军会出现，杀死火刃将军并与众人开战</p>

    <p class="imp"><b>英雄救美（机关魔龙+飞仙）</b><br>
        内容:飞仙遭受机关魔龙的攻击向众人求救，若一回合内打败机关魔龙，飞仙会请求加入队伍</p>
</div></template>